package data

data class Post(
    val id: Int,                       // Идентификатор записи
    val ownerId: Int,                  // Идентификатор владельца стены, на которой размещена запись
    val fromId: Int,                   // Идентификатор автора записи (от чьего имени опубликована запись)
    val createdBy: Int,                // Идентификатор администратора, который опубликовал запись
    val date: Int,                     // Время публикации записи в формате unixtime
    val text: String,                  // Текст записи
    val coments: Coments,              // Информация о комментариях к записи
    val likes: Likes,                  // Информация о лайках к записи
    val replyOwnerId: Int = 0,         // Идентификатор владельца записи, в ответ на которую была оставлена текущая
    val replyPostId: Int = 0,          // Идентификатор записи, в ответ на которую была оставлена текущая
    val friendsOnly: Boolean = false,  // true если запись была создана с опцией «Только для друзей»
    val canPin: Boolean = false,       // Информация о том, может ли текущий пользователь закрепить запись
    val canDelete: Boolean = false,    // Информация о том, может ли текущий пользователь удалить запись
    val canEdit: Boolean = false       // Информация о том, может ли текущий пользователь редактировать запись
)
